SET DATABASE SQL SYNTAX PGS TRUE;

INSERT INTO users (id, name, email, password)
VALUES
(0, 'Алексей', 'user@yandex.ru', 'password'),
(1, 'Егор', 'admin@gmail.com', 'admin'),
(2, 'Игорь', 'stack@yandex.com', 'Itest'),
(3, 'Анна', 'anna2000@mail.com', 'anneta'),
(4, 'Евгений', 'orbita13@outlook.com', 'orbit'),
(5, 'Ольга', 'thelastofuspart2@gmail.com', 'joelisdeadabbyisskura');

INSERT INTO user_roles (role, role_id) VALUES
('USER', 0),
('ADMIN', 1),
('USER', 2),
('ADMIN', 3),
('USER', 4),
('ADMIN', 5);

INSERT INTO restaurants (id_rest, id_owner_rest, name_rest, address)
VALUES
(0, 1, 'Якитория', 'г.Москва; ст.м. Тимирязевская'),
(1, 3, 'Шаурдональдс', 'г.Москва; ст.м. Новослободская'),
(2, 5, 'Пицца Папа Джонс', 'г.Москва; ст.м. Проспект Мира');

INSERT INTO menus (id_menu, id_rest, counter_voice, date)
VALUES
-- Данные о голосовании за обеды в Якитории
(0, 0, 1500, '2020-07-14'),
(1, 0, 1550, '2020-07-15'),
(2, 0, 1560, '2020-07-16'),
-- Данные о голосовании за обеды в Шаурдональдсе
(3, 1, 1100, '2020-07-14'),
(4, 1, 736, '2020-07-15'),
(5, 1, 1080, '2020-07-16'),
-- Данные о голосовании за обеды в Папе Джонс
(6, 2, 699, '2020-07-14'),
(7, 2, 1885, '2020-07-15'),
(8, 2, 1375, '2020-07-16');

INSERT INTO voters (menu_id, voter_id_pk, date, voice)
VALUES
--Голосователь 1
(0, 0, '2020-07-14', true),
--(null, 0, '2020-07-15', false),
(8, 0, '2020-07-16', true),
--Голосователь 2
--(null, 2, '2020-07-14', false),
(7, 2, '2020-07-15', true),
--(null, 2, '2020-07-16', false),
--Голосователь 3
(0, 4, '2020-07-14', true),
(4, 4, '2020-07-15', true);
--(null, 4, '2020-07-16', false);

INSERT INTO meals (menu_id, name, description, calories, price)
VALUES
--Якитория.
--Состав меню за 14-07-2020
(0,'Кофе','капучино', 200, 2.49),
(0,'Сет микс','10/15/20 шт', 1300, 5.59),
(0,'Суп','из осьминога', 350, 4.29),
(0,'Хлеб','черный/белый', 100, 0.99),
(0,'Пончики','шоколадные/с сахарной пудрой 5шт', 400, 3.99),
--Состав меню за 15-07-2020
(1,'Кофе','латте', 200, 2.49),
(1,'Королевский сет','10/15/20 шт', 1500, 7.99),
(1,'Суп','Из крокодила', 330, 4.29),
(1,'Хлеб','черный/белый', 100, 0.99),
(1,'Кекс','куряга/изюм/вишня', 250, 2.7),
--Состав меню за 16-07-2020
(2,'Чай','лимон/персик/яблоко/апельсин/черный/зеленый', 100, 1.2),
(2,'Сет дары моря','10/15/20 шт', 900, 6.49),
(2,'Суп','из морской капусты', 300, 3.49),
(2,'Хлеб','черный/белый', 100, 0.99),
(2,'Кекс','шоколадный/ванильный', 300, 2.99),

--Шаурдональдс.
--Состав меню за 14-07-2020
(3,'Сок','персик/яблоко/виноград/мультифрукт', 160, 2.00),
(3,'Шаурма','острая', 600, 4.40),
(3,'Пирожки','картошка/капуста/яблоко 3шт', 500, 3.29),
(3,'Мороженное','шоколадное/ванильное', 250, 1.49),
(3,'Рогалик','шоколадный/ванильный/яблочный/персиковый крем', 280, 3.2),
--Состав меню за 15-07-2020
(4,'Сок','персик/яблоко/виноград/мультифрукт', 160, 2.00),
(4,'Шаурма','сырная', 700, 4.99),
(4,'Блины','картошка/сметана 3шт', 400, 2.79),
(4,'Мороженное','шоколадное/ванильное', 250, 1.49),
(4,'Пирожные','махаон/медовик', 300, 2.9),
--Состав меню за 16-07-2020
(5,'Сок','персик/яблоко/виноград/мультифрукт', 100, 2.00),
(5,'Шаурма','вегетарианская', 400, 4.99),
(5,'Сырники','обыкновенные 300гр', 400, 2.99),
(5,'Мороженное','шоколадное/ванильное', 250, 1.49),
(5,'Пирожные',' картошка', 300, 2.9),

--Папа Джонс.
--Состав меню за 14-07-2020
(6,'Пиво','темное/светлое', 300, 1.6),
(6,'Пицца','Итальянская 30/45 см', 1100, 7.00),
(6,'Стейк','свиной/говяжий', 700, 5.79),
(6,'Сок','яблоко/персик/мультифрукт', 200, 2.49),
(6,'Мороженное','шоколадное/полонез', 290, 3.00),
--Состав меню за 15-07-2020
(7,'Пиво','темно/светлое', 300, 1.6),
(7,'Пицца','С солями 30/45 см', 1200, 6.49),
(7,'Рулька','свиная', 800, 6.49),
(7,'Мороженное','шоколадное/ванильное', 250, 1.49),
(7,'Кекс','шоколадный/ванильный', 200, 2.49),
--Состав меню за 16-07-2020
(8,'Пиво','темное/светлое', 300, 1.6),
(8,'Пицца','4 сыра 30/45 см', 1000, 6.49),
(8,'Грудка','куриная', 400, 4.99),
(8,'Мороженное','шоколадное/ванильное', 250, 1.49),
(8,'Мус','шоколадный/ванильный', 280, 2.7);
